In [55]:
import pandas as pd
import sklearn
from sklearn.preprocessing import OneHotEncoder

# Leitura dos dados

In [54]:
df_original = pd.read_csv('solar-flare.csv', header = None, skiprows = 1)
print("Dados:")
print("Número de linhas: {}\nNúmero de colunas: {}".format(data.shape[0], data.shape[1]))

Dados:
Número de linhas: 1066
Número de colunas: 1

Impressão das primeiras e últimas 10 amostras do conjunto de dados

In [61]:
df_original.head(10)

                           0
0  H A X 1 3 1 1 1 1 1 0 0 0
1  D R O 1 3 1 1 2 1 1 0 0 0
2  C S O 1 3 1 1 2 1 1 0 0 0
3  H R X 1 2 1 1 1 1 1 0 0 0
4  H S X 1 1 1 1 2 1 1 0 0 0
5  C A O 1 2 1 1 2 1 1 0 0 0
6  B X O 1 3 1 1 2 1 1 0 0 0
7  C A O 1 3 1 1 2 1 1 0 0 0
8  C A O 1 2 1 1 2 1 1 1 0 0
9  B X O 1 3 1 1 2 1 1 0 0 0

In [57]:
df_original.tail(10)

                              0
1056  H S X 1 2 1 1 2 1 1 1 0 0
1057  D S O 1 2 1 2 2 1 1 0 0 0
1058  H S X 1 2 2 2 2 1 1 0 0 0
1059  H S X 2 2 1 1 2 1 1 0 0 0
1060  D R O 1 3 1 1 2 1 1 0 0 0
1061  H S X 1 2 1 1 1 1 1 0 0 0
1062  H S X 2 2 1 1 2 1 1 0 0 0
1063  C S O 1 2 1 2 2 1 1 0 0 0
1064  H R X 1 2 1 1 2 1 1 0 0 0
1065  B X O 1 1 1 1 2 1 1 0 0 0

Para facilitar a manipulação dos dados, separamos a coluna composta por todos os dados em 13 colunas de nomes correspondentes a seus significados. O significado de cada valor foi retirado da fonte da base, disponível em https://archive.ics.uci.edu/ml/datasets/Solar+Flare

In [51]:
df_original[['class_code', 'largest_spot_size', 'spot_distribution',
         'activity', 'evolution', '24_flare_activity', 
         'historically_complex', 'region_become_hcomplex', 'area',
         'largest_spot_area', 'c_class', 'm_class', 'x_class']] = df_original[0].str.split(' ', expand = True)
df_data = df_original[['class_code','largest_spot_size', 'spot_distribution', 'activity',
                       'evolution', '24_flare_activity', 'historically_complex',
                       'region_become_hcomplex', 'area', 'largest_spot_area',
                       'c_class', 'm_class', 'x_class']]

Ao final da separação dos dados em colunas, temos o conjunto de dados organizados da seguinte forma:

In [53]:
df_data.head(5)

,class_code,largest_spot_size,spot_distribution,activity,evolution,24_flare_activity,historically_complex,region_become_hcomplex,area,largest_spot_area,c_class,m_class,x_class
0,H,A,X,1,3,1,1,1,1,1,0,0,0
1,D,R,O,1,3,1,1,2,1,1,0,0,0
2,C,S,O,1,3,1,1,2,1,1,0,0,0
3,H,R,X,1,2,1,1,1,1,1,0,0,0
4,H,S,X,1,1,1,1,2,1,1,0,0,0

# Conversão os atributos categóricos para numéricos